# .zsh_plugins.txt

# completions
mattmc3/ez-compinit         # this needs to be first to manage compinit weirdness
zsh-users/zsh-completions kind:fpath path:src

# plugins
akash329d/zsh-alias-finder
mdumitru/git-aliases
zpm-zsh/autoenv             # ensure $AUTOENV_IN_FILE and $AUTOENV_OUT_FILE are set
fourdim/zsh-poetry          # ensure $ZSH_CACHE_DIR is set
belak/zsh-utils path:history

# prompts:
#   with prompt plugins, remember to add this to your .zshrc:
#   `autoload -Uz promptinit && promptinit && prompt powerlevel10k`
romkatv/powerlevel10k kind:fpath

# popular fish-like plugins
zdharma-continuum/fast-syntax-highlighting  # Syntax highlighting
zdharma-continuum/history-search-multi-word # History Search Multiword for Ctrl-R
zsh-users/zsh-autosuggestions               # Auto-suggestions
zsh-users/zsh-history-substring-search      # Up/Down to search history

# local aliases
~/.aliases
